In [52]:
import numpy as np
import pandas as pd

In [4]:
# series 
monthly_revenue = pd.Series([3000,5000,6000,np.nan], name= "Revenue")
print(monthly_revenue)

0    3000.0
1    5000.0
2    6000.0
3       NaN
Name: Revenue, dtype: float64

In [10]:
#DataFrame
data = {
'Employee':['ali','ola','magdy','mai'],
'company':['amazon','apple','sony','addidas'],
'Experience_Years':[5,2,3,8]    
}
df = pd.DataFrame(data)
print(df)

  Employee  company  Experience_Years
0      ali   amazon                 5
1      ola    apple                 2
2    magdy     sony                 3
3      mai  addidas                 8

In [19]:
df.head(2)
df.tail(2)

  Employee  company  Experience_Years
2    magdy     sony                 3
3      mai  addidas                 8

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Employee          4 non-null      object
 1   company           4 non-null      object
 2   Experience_Years  4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [25]:
df.describe()

       Experience_Years
count          4.000000
mean           4.500000
std            2.645751
min            2.000000
25%            2.750000
50%            4.000000
75%            5.750000
max            8.000000

In [26]:
# check if any values are missing
print(df.isna().sum())

Employee            0
company             0
Experience_Years    0
dtype: int64

In [28]:
# view full matrix of missing positions
print(df.isna())

   Employee  company  Experience_Years
0     False    False             False
1     False    False             False
2     False    False             False
3     False    False             False

In [29]:
df.loc[1,'Experience_Years'] = np.nan
print(df)

  Employee  company  Experience_Years
0      ali   amazon               5.0
1      ola    apple               NaN
2    magdy     sony               3.0
3      mai  addidas               8.0

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Employee          4 non-null      object
 1   company           4 non-null      object
 2   Experience_Years  3 non-null      float64
dtypes: float64(1), object(2)
memory usage: 228.0+ bytes

In [31]:
df.isna().sum()

Employee            0
company             0
Experience_Years    1
dtype: int64

In [33]:
df.isna()

   Employee  company  Experience_Years
0     False    False             False
1     False    False              True
2     False    False             False
3     False    False             False

In [34]:
#Drop null values
df.dropna()

  Employee  company  Experience_Years
0      ali   amazon               5.0
2    magdy     sony               3.0
3      mai  addidas               8.0

In [36]:
#To restore the data to its original state 
data = {
'Employee':['ali','ola','magdy','mai'],
'company':['amazon','apple','sony','addidas'],
'Experience_Years':[5,2,3,8]    
}
df = pd.DataFrame(data)
print(df)

  Employee  company  Experience_Years
0      ali   amazon                 5
1      ola    apple                 2
2    magdy     sony                 3
3      mai  addidas                 8

In [40]:
# Selecting and Filtering data
print(df['company'])
print(df[['Employee','Experience_Years']])

0     amazon
1      apple
2       sony
3    addidas
Name: company, dtype: object
  Employee  Experience_Years
0      ali                 5
1      ola                 2
2    magdy                 3
3      mai                 8

In [41]:
#selecting rows
df.loc[2] #row by lable 
df.iloc[2]#row by position

Employee            magdy
company              sony
Experience_Years        3
Name: 2, dtype: object

In [45]:
# Filtering 
print(df[df['Experience_Years']>5])

  Employee  company  Experience_Years
3      mai  addidas                 8

In [47]:
# Standerdize to data
df['company'] = df['company'].str.upper()
print(df['company'])

0     AMAZON
1      APPLE
2       SONY
3    ADDIDAS
Name: company, dtype: object

In [48]:
# Add new column to dataframe
df['is_very_senior'] = df['Experience_Years']>=8
print(df)

  Employee  company  Experience_Years  is_very_senior
0      ali   AMAZON                 5           False
1      ola    APPLE                 2           False
2    magdy     SONY                 3           False
3      mai  ADDIDAS                 8            True

In [62]:
df_project = pd.DataFrame({
    'client':['kiwilytics','EY','KPMG','McKinsey'],
    'Budget_KUSD':[120,200,150,None]
})
print(df_project)

       client  Budget_KUSD
0  kiwilytics        120.0
1          EY        200.0
2        KPMG        150.0
3    McKinsey          NaN

In [69]:
# fill missing values whith mean
mean_budget = df_project['Budget_KUSD'].mean()
df_project=df_project.fillna(mean_budget)
print(mean_budget)
print(df_project)

156.66666666666666
       client  Budget_KUSD
0  kiwilytics   120.000000
1          EY   200.000000
2        KPMG   150.000000
3    McKinsey   156.666667

In [70]:
print(df_project)

       client  Budget_KUSD
0  kiwilytics   120.000000
1          EY   200.000000
2        KPMG   150.000000
3    McKinsey   156.666667

In [73]:
# Grouping & Aggregating DataFrames
df_revenue = pd.DataFrame({
    'company':['Kiwilytics','Pwc','EY','KPMG','Kiwilytics','Pwc'],
    'Quarter':['Q1','Q1','Q1','Q1','Q2','Q2'],
    'Revenue_kUSD':[120,200,180,150,130,210]
})
print(df_revenue)
groupped = df_revenue.groupby('company')['Revenue_kUSD'].sum()
print(groupped )

      company Quarter  Revenue_kUSD
0  Kiwilytics      Q1           120
1         Pwc      Q1           200
2          EY      Q1           180
3        KPMG      Q1           150
4  Kiwilytics      Q2           130
5         Pwc      Q2           210
company
EY            180
KPMG          150
Kiwilytics    250
Pwc           410
Name: Revenue_kUSD, dtype: int64

In [81]:
# Merge
df_managers = pd.DataFrame({
    'ManagerID':[1,2,3],
    'Name':['Ola','Maher','Menna']
})
print(df_managers)
df_projects = pd.DataFrame({
    'projectID':[101,102,103],
    'ManagerID':[1,2,3],
    'Client':['Amazon','Sony','Apple']
})
print(df_projects)
merged_df=pd.merge(df_managers, df_projects, on='ManagerID',how='inner')
print(merged_df)

   ManagerID   Name
0          1    Ola
1          2  Maher
2          3  Menna
   projectID  ManagerID  Client
0        101          1  Amazon
1        102          2    Sony
2        103          3   Apple
   ManagerID   Name  projectID  Client
0          1    Ola        101  Amazon
1          2  Maher        102    Sony
2          3  Menna        103   Apple

In [ ]:
# convert dates (Error Types: #coerce #ignore #raise)
df['orderdate'] = pd.to_datetime(df['orderdate'],errors = 'coerce')
#coerce--> NaNبيحول اى تاريخ مش عارف يحولو ل

In [ ]:
df['shippingcost'] = pd.to_numeric(df['shippingcost'],errors = 'coerce')
df.loc[df['shippingcost']<0,'shippingcost'] = np.nan

In [ ]:
# handle nulls
df['orderID'] = df['orderID'].fillna(method='ffill')#املأ اى قيمة null بالقيمة اللى قبلها
df['customerID']=df['customerID'].fillna("Unknown")
df['shipcity']=df['shipcity'].fillna("Unspecified")

In [82]:
# standardize names
df['shipcountry']=df['shipcountry'].str.strip().str.title()#remove spaces and the frist char be capital
df['shipcity']=df['shipcity'].str.strip().str.title()
df['shippingCompany']=df['shippingCompany'].str.strip()

In [83]:
# fix specific cases
df.loc[df['shippingCompany'].str.contains("Kiwilytics",na=False),'shoppingCompany']='Kiwilytics Goods Shipping LLC.'

In [84]:
# Export cleaned file
df.to_csv("cleaned_orders_final.csv",index=False)